# **SQL METHODS**

In SQL, methods refer to functions or procedures that perform specific tasks within your queries. They are like pre-defined tools that you can use to manipulate, analyze, or interact with your data in various ways.

#### **Import SQLite3**

In [59]:
import sqlite3

#### **Connect to the SQLite Database**
If you want to create the database file in the current directory (where your Jupyter Notebook is located) and specify the name of the database file, you can do it like this:

In [60]:
conn = sqlite3.connect("sqlite-crud.db")
cursor = conn.cursor()

### **SELECT**

The SELECT statement in SQL retrieves data from one or more tables, allowing users to specify columns to fetch and apply filters, sorting, and aggregations to manipulate the data returned.

In [61]:
cursor.execute("SELECT * FROM employees")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

### **DISTINCT**

The **DISTINCT** keyword is used to return only distinct (unique) values in the result set of a query. It ensures that duplicate rows are removed from the output.

In [62]:
cursor.execute("""
SELECT DISTINCT department FROM employees
""")
cursor.fetchall()

[('Marketing',), ('Sales',), ('Operations',), ('IT',), ('Finance',), ('HR',)]

### **LIMIT**

The **LIMIT** clause specifies the maximum number of rows to return in a query result.

In [63]:
cursor.execute("""
SELECT * FROM employees LIMIT 5
               
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4)]

In [64]:
cursor.execute("""
SELECT * FROM employees 
LIMIT 0, 10 
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4)]

In [65]:
# LIMIT(starting offset - will not be displayed, how many records to display)
cursor.execute("""
SELECT * FROM employees
LIMIT 3, 2
""")
cursor.fetchall()

[(5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4)]

### **COUNT**

The **COUNT** function is used to count the number of rows in a table or the number of rows matching a specific condition.

In [66]:
cursor.execute("SELECT COUNT(*) FROM employees")
cursor.fetchall()

[(29,)]

### **WHERE**

The **WHERE** clause is used to filter data retrieved from a database based on specific conditions.

### **Comparison Operators:**
#### `=`: Equal to

In [67]:
cursor.execute("SELECT COUNT(*) FROM employees WHERE department = 'IT'")
cursor.fetchall()

[(5,)]

#### `!=` : Not equal to

In [68]:
cursor.execute("SELECT COUNT(*) FROM employees WHERE department != 'IT'")
cursor.fetchall()

[(24,)]

#### `<` : Less than

In [69]:
cursor.execute("SELECT * FROM employees WHERE salary <= 59000")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2)]

#### `>` : Greater than

In [70]:
cursor.execute("SELECT * FROM employees WHERE salary >= 60000")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

#### `<=` : Less than or equal to

In [71]:
cursor.execute("SELECT * FROM employees WHERE salary <= 59000")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2)]

#### `>=` : Greater than or equal to

In [72]:
cursor.execute("SELECT * FROM employees WHERE salary >= 60000")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

### **Logical Operators:**
#### `AND`: Used to combine multiple conditions where both must be true.

In [73]:
cursor.execute("""
    SELECT * FROM employees WHERE department = 'Sales' AND performance_rating >3
""")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5)]

#### `OR`: Used to combine multiple conditions where at least one must be true.

In [74]:
cursor.execute("""
    SELECT * FROM employees WHERE department = 'Operations' OR department = 'Marketing'
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

#### `NOT`: Used to negate a condition.

In [75]:
cursor.execute("""
    SELECT * FROM employees WHERE NOT department = "IT"
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

### **Special Operators:**
#### `BETWEEN`: Checks if a value falls within a specified range.

In [76]:
cursor.execute("""
    SELECT * FROM employees WHERE salary BETWEEN 60000 AND 65000
""")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

#### `IN`: Checks if a value belongs to a set of values.

In [77]:
cursor.execute("""
    SELECT * FROM employees WHERE department IN ('IT','Sales')
""")
cursor.fetchall()

[(3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4)]

#### `LIKE`: Used for pattern matching with wildcards.

In [78]:
# %string - ending substring
cursor.execute("""
    SELECT * FROM employees WHERE first_name LIKE 'ja%'
""")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4)]

### **ORDER BY**

The **ORDER BY** clause allows you to sort the results of your SELECT queries in either ascending or descending order. It lets you sort the retrieved data based on one or more columns, making it easier to analyze and interpret.

#### `ASC:` Ascending order (lowest to highest). (Default)

#### `DESC:` Descending order (highest to lowest).

### **GROUP BY**

The **GROUP BY** clause is used to organize and summarize data by grouping rows with the same values in one or more columns. This helps you analyze trends, patterns, and aggregate statistics within your data.

#### Grouping with `COUNT()`

#### Grouping with `SUM()`

#### Grouping with `AVG()`